[
  {
    "Id": "925938",
    "ThreadId": "399148",
    "Html": "\r\n<p>I've been unable to add an image to a document using PHPWord, though the same images are being successfully added to a presentation using PHPPowerPoint.&nbsp; the DOCX file is generated successfully with the text I added, however the images are not visible\r\n (there's a large amount of white space where the image should be).</p>\r\n<p>the code for adding the images is very simple, I feel:</p>\r\n<p></p>\r\n<div style=\"color:black; background-color:white\">\r\n<pre><span style=\"color:blue\">foreach</span>($charts <span style=\"color:blue\">as</span> $chart)\r\n{\r\n  $section = $doc-&gt;createSection();\r\n\r\n  $section-&gt;addText($chart[<span style=\"color:#a31515\">'title'</span>], <span style=\"color:#a31515\">'titleFont'</span>, <span style=\"color:#a31515\">'titleParagraph'</span>);\r\n\r\n  $section-&gt;addImage($chart[<span style=\"color:#a31515\">'image_path'</span>], <span style=\"color:blue\">array</span>(\r\n    <span style=\"color:#a31515\">'align'</span> =&gt; <span style=\"color:#a31515\">'center'</span>\r\n  ));\r\n}\r\n</pre>\r\n</div>\r\n<p></p>\r\n<p>an example of what image_path might contain: /var/www/html/ ..... /charts/3/500x350.png</p>\r\n<p>I've tried mucking with the path, and accidentally caused &quot;file could not be found or is not of support type&quot;-type errors from PHPWord, suggesting that it is usually finding my image, AND it is of a supported type.&nbsp; and again, these same paths/images\r\n have been used to generate presentations with PHPPowerPoint.&nbsp; (I'm offering downloads for the user in many formats, which all look to these PNGs.)&nbsp; I've also tried various combinations of 'align', 'width', 'height' attributes for the image styling.</p>\r\n<p>if it would help to see more of the code, I'm happy to copy/paste it.&nbsp; I can also provide a sample DOCX generated by the code if needed.</p>\r\n",
    "PostedDate": "2012-10-12T11:01:01.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926496",
    "ThreadId": "399148",
    "Html": "<p>This maybe help you ,have a look.</p>\r\n<p><a href=\"http://phpword.codeplex.com/discussions/260643\">http://phpword.codeplex.com/discussions/260643</a></p>",
    "PostedDate": "2012-10-14T19:16:03.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "926529",
    "ThreadId": "399148",
    "Html": "\r\n<p>I saw that thread, but it was unfortunately not helpful for me.</p>\r\n<p>HOWEVER: I've discovered something new: the images from my PHPWord-generated DOCX files load up fine in Microsoft Office, but not in OpenOffice!&nbsp; (I usually use OpenOffice.)&nbsp; I've never noticed OpenOffice failing to load images before, so I suspect\r\n this is due to a difference in how OpenOffice and MS Office read DOCX files, and how PHPWord specifically generates the DOCX files.</p>\r\n<p>if I had to guess, I'd guess OpenOffice is being more-strict about the DOCX format, while MS Office is being less-strict, but I really can only guess.&nbsp; I tried poking around MS's Open XML SDK to see if I could learn anything, but learning the Open XML\r\n format is... a lot of work; I suspect my boss will tell me it's not worth the time, and it's not something I'd want to do for fun :P</p>\r\n<p>a new question: in your opinion, is this a bug in PHPWord, or OpenOffice?&nbsp; (should I file a bug report with OpenOffice?)</p>\r\n",
    "PostedDate": "2012-10-14T22:09:02.883-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]