[
  {
    "Id": "967823",
    "ThreadId": "415323",
    "Html": "\r\n<p>Hello!</p>\r\n<p>PHPWord provides all the features we were looking for... but we have a problem. Using PHPWord, I generate a .docx document which contains tables with different cell sizes. However, when I open my document using Libreoffice (I've tried with versions 3.6.4\r\n and 4.0 beta) the width I introduced for the row of the table is completely ignored (just the width, any other format I introduce is correctly displayed)</p>\r\n<p>I've tried to open the document with MSWord, and the cell widths are correct. I've converted the document to .doc and then opened it with Libreoffice, and it works. I've tried to open the document with MSWord, save it again and open it with Libreoffice...\r\n and it works properly too. Therefore I believe it has to do with the way the tables are generated by PHPWord, but I can't figure out what is exactly going on.</p>\r\n<p>Does anyone know how could I solve this and generate a document which keeps cell widths in Libreoffice?</p>\r\n<p>Thanks a lot!</p>\r\n",
    "PostedDate": "2012-12-24T03:16:34.003-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "984077",
    "ThreadId": "415323",
    "Html": "\r\n<p>I've got exactly the same problem. I am using Openoffice's headless service to generate PDF's from the documents and the cells are spaced equally across the page.</p>\r\n<p>Also think the problem is with how the XML is being written to the .docx file.&nbsp;</p>\r\n<p>If you find a solution, please let me know,&nbsp;</p>\r\n<p>Thanks!</p>\r\n",
    "PostedDate": "2013-01-08T06:16:28.56-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "986714",
    "ThreadId": "415323",
    "Html": "\r\n<p>I have come up with a solution for this problem - which will hopefully work for you too - see:\r\n<a href=\"https://phpword.codeplex.com/workitem/31\">https://phpword.codeplex.com/workitem/31</a>.</p>\r\n",
    "PostedDate": "2013-01-14T13:46:35.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "986861",
    "ThreadId": "415323",
    "Html": "\r\n<p>Hello;</p>\r\n<p>Thank you @neilt17!&nbsp;</p>\r\n<p>Unfortunately I don't think I'll check this solution, at least not at this moment since I've no time. Anyway, the solution I came up with in the end was to generate the document .doc from HTML, as we already had a lot of the HTML generated so it was an easy\r\n conversion. Hopefully future versions of LibreOffice will be able to handle with this without the need of your solution ^^</p>\r\n",
    "PostedDate": "2013-01-14T23:52:53.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "986863",
    "ThreadId": "415323",
    "Html": "\r\n<p>Hi&nbsp;<a href=\"http://www.codeplex.com/site/users/view/neilt17\">neilt17</a>,&nbsp;</p>\r\n<p>I've downloaded your source code and am trying to implement it in my project but as soon as I add a cell to a table (even using the basic example) I get the following error :&nbsp;</p>\r\n<p>Fatal error: Call to a member function getSettings() on a non-object in /Applications/XAMPP/xamppfiles/htdocs/reivilo/libs/PHPWord/Writer/Word2007/Base.php on line&nbsp;396</p>\r\n<p>Did I forget something?</p>\r\n<p>Thanks for your trouble, really hoping I can get this sorted....</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-14T23:59:09.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "987187",
    "ThreadId": "415323",
    "Html": "\r\n<p>andrejbs, Does this happen when you navigate to an example file, e.g. phpword/Examples/BasicTable.php, or are you using some other code? If so, could you let me know what this code is? I am not getting a problem with the example files myself.</p>\r\n",
    "PostedDate": "2013-01-15T10:02:02.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "987218",
    "ThreadId": "415323",
    "Html": "\r\n<p>My code was situated in a function and had to add the 'global $section' variable so base.php could read it.&nbsp;</p>\r\n<p>You are a legend my man...</p>\r\n<p>Works like a charm..</p>\r\n<p>I started this project 8 months ago hoping a solution would come along...and it did just at the right time. Divine intervention I call it.</p>\r\n<p>&nbsp;</p>\r\n<p>Take care,&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2013-01-15T10:56:42.11-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "988869",
    "ThreadId": "415323",
    "Html": "\r\n<p>Thank you andrejbs!</p>\r\n<p>I have now finished (hopefully!) adapting the PHPWord code for this. The latest code now also works for tables in the header and footer as well as the main body of the document. It is available here:\r\n<a href=\"http://htmltodocx.codeplex.com/SourceControl/changeset/view/20654e75629c\">\r\nhttp://htmltodocx.codeplex.com/SourceControl/changeset/view/20654e75629c</a></p>\r\n",
    "PostedDate": "2013-01-18T10:55:56.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "994631",
    "ThreadId": "415323",
    "Html": "The modified version of PHPWord to deal with this issue is now in the latest recommended release of the <a href=\"http://htmltodocx.codeplex.com/\" rel=\"nofollow\">HTML to docx Converter</a>. It would be great if these modifications could to be added into the PHPWord code here too.<br />\n",
    "PostedDate": "2013-01-31T03:50:17.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]